Yes I see your point on both.  They should be set in the root "eks" module and I carelessly used the ARN instead of the name for node_iam_role_name.  It was a lazy copy of how I copied iam_role_arn.  Thanks for your patience and taking the time to show me my errors.

I did move those vars up.

```
module "eks" {
  source  = "terraform-aws-modules/eks/aws"
  version = "20.34.0"

  cluster_name    = var.cluster_name
  cluster_version = var.k8s_version

  create_iam_role = false
  iam_role_arn    = data.aws_iam_role.cluster_role.arn 

  create_node_iam_role  = false
  node_iam_role_name    = var.node_role_name
```

and I'm seeing the same result

```
  # module.eks.module.eks.module.eks_managed_node_group["ubuntupro"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
...
  # module.eks.module.eks.module.eks_managed_node_group["stig_ubuntupro"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-us-gov:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }
  # module.eks.module.eks.module.eks_managed_node_group["stig_ubuntupro"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-us-gov:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }
```

